Autodesk.Revit.DB.TextElement.GetMaximumAllowedWidth(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
Returns the maximum width the text element can be created with.
Remarks:
Note that it is not necessarily a constant; it can be affected
by properties of the text type, such as the width factor.
cdda:
A document containing the new text element's type
typeId:
Id of the text type
Returns:
The maximum allowed width in paper space [ft].
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2016

Autodesk.Revit.DB.TextElement.GetMinimumAllowedWidth(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
Returns the minimum width a text element can be created with.
Remarks:
Note that it is not necessarily a constant; it can be affected
by properties of the text type, such as the width factor.
cdda:
A document containing the new text element's type
typeId:
Id of the text type
Returns:
The minimum allowed width in paper space [ft].
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2016

Autodesk.Revit.DB.TextElement.Text
The content of the element as a plain string stripped of all formating.
Remarks:
If a new text content is set, all previous formating that might have been
set on parts of the original text will be lost. After setting the new text,
only the formating parameters of the associated text type will be applied.
The value of this property can also be accessed via the TEXT_TEXT
Built-In parameter.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null

Autodesk.Revit.DB.TextElement.Coord
Position of the text (in model coordinates.)
Remarks:
The position defines a point on the edge of the text area,
not a point on the border (if a border is defined for the style.)
It means that if the width of the border gets changed, the
position of the text area remains unchanged.
The relation of the position point with respect
to the text area depends on the text alignment as follows:
For Left-aligned text the point is at the Left-Top corned of the box.
For Center-aligned text the point is at the Middle-Top corned of the box.
For Right-aligned text the point is at the Right-Top corned of the box.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: A valid point must not be father then 10 miles (approx. 16 km) from the origin.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null